<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="audio_sequences" type="Parameter" version="opset1">
			<data shape="1,1,80,16" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="audio_sequences">
					<dim>1</dim>
					<dim>1</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="face_sequences" type="Parameter" version="opset1">
			<data shape="1,6,96,96" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="face_sequences">
					<dim>1</dim>
					<dim>6</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_542" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 3, 3" offset="0" size="1152" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_542">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/audio_encoder/audio_encoder.0/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_140" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1152" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/audio_encoder/audio_encoder.0/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.0/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/audio_encoder/audio_encoder.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_545" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="1280" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_545">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/audio_encoder/audio_encoder.1/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_154" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="38144" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/audio_encoder/audio_encoder.1/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.1/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/audio_encoder/audio_encoder.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.1/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/audio_encoder/audio_encoder.1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.1/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="onnx::Conv_548" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="38272" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_548">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/audio_encoder/audio_encoder.2/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_169" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="75136" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/audio_encoder/audio_encoder.2/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.2/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/audio_encoder/audio_encoder.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.2/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/audio_encoder/audio_encoder.2/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.2/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="onnx::Conv_551" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="75264" size="73728" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_551">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/audio_encoder/audio_encoder.3/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="3, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_184" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="148992" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/audio_encoder/audio_encoder.3/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.3/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/audio_encoder/audio_encoder.3/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.3/act/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="onnx::Conv_554" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="149248" size="147456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_554">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/audio_encoder/audio_encoder.4/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_198" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="296704" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/audio_encoder/audio_encoder.4/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.4/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/audio_encoder/audio_encoder.4/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.4/Add_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/audio_encoder/audio_encoder.4/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.4/act/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="onnx::Conv_557" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="296960" size="147456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_557">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/audio_encoder/audio_encoder.5/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="444416" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/audio_encoder/audio_encoder.5/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.5/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/audio_encoder/audio_encoder.5/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.5/Add_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/audio_encoder/audio_encoder.5/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.5/act/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_560" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="444672" size="294912" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_560">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/audio_encoder/audio_encoder.6/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="3, 3" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_228" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="739584" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/audio_encoder/audio_encoder.6/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.6/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/audio_encoder/audio_encoder.6/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.6/act/Relu_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Conv_563" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="740096" size="589824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_563">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/audio_encoder/audio_encoder.7/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_242" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1329920" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/audio_encoder/audio_encoder.7/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.7/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/audio_encoder/audio_encoder.7/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.7/Add_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/audio_encoder/audio_encoder.7/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.7/act/Relu_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="onnx::Conv_566" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="1330432" size="589824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_566">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/audio_encoder/audio_encoder.8/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_257" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1920256" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/audio_encoder/audio_encoder.8/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.8/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/audio_encoder/audio_encoder.8/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.8/Add_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/audio_encoder/audio_encoder.8/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.8/act/Relu_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="onnx::Conv_569" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1920768" size="1179648" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_569">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/audio_encoder/audio_encoder.9/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="3, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_272" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="3100416" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/audio_encoder/audio_encoder.9/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.9/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/audio_encoder/audio_encoder.9/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.9/act/Relu_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_572" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="3101440" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_572">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/audio_encoder/audio_encoder.10/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_286" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5460736" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/audio_encoder/audio_encoder.10/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.10/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/audio_encoder/audio_encoder.10/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.10/Add_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/audio_encoder/audio_encoder.10/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.10/act/Relu_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="onnx::Conv_575" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="5461760" size="4718592" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_575">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/audio_encoder/audio_encoder.11/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_301" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="10180352" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/audio_encoder/audio_encoder.11/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.11/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/audio_encoder/audio_encoder.11/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.11/act/Relu_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Conv_578" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="10182400" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_578">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/audio_encoder/audio_encoder.12/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Reshape_315" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="11230976" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/audio_encoder/audio_encoder.12/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audio_encoder/audio_encoder.12/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/audio_encoder/audio_encoder.12/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audio_encoder/audio_encoder.12/act/Relu_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Conv_635" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="11233024" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_635">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/face_decoder_blocks.0/face_decoder_blocks.0.0/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_591" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="12281600" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/face_decoder_blocks.0/face_decoder_blocks.0.0/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_decoder_blocks.0/face_decoder_blocks.0.0/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/face_decoder_blocks.0/face_decoder_blocks.0.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/face_decoder_blocks.0/face_decoder_blocks.0.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Conv_581" type="Const" version="opset1">
			<data element_type="f32" shape="16, 6, 7, 7" offset="12283648" size="18816" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_581">
					<dim>16</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/face_encoder_blocks.0/face_encoder_blocks.0.0/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_329" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="12302464" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/face_encoder_blocks.0/face_encoder_blocks.0.0/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_encoder_blocks.0/face_encoder_blocks.0.0/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/face_encoder_blocks.0/face_encoder_blocks.0.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/face_encoder_blocks.0/face_encoder_blocks.0.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_584" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="12302528" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_584">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/face_encoder_blocks.1/face_encoder_blocks.1.0/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_343" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12320960" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/face_encoder_blocks.1/face_encoder_blocks.1.0/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.0/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/face_encoder_blocks.1/face_encoder_blocks.1.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="onnx::Conv_587" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="12321088" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_587">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/face_encoder_blocks.1/face_encoder_blocks.1.1/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_357" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12357952" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/face_encoder_blocks.1/face_encoder_blocks.1.1/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.1/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/face_encoder_blocks.1/face_encoder_blocks.1.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.1/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/face_encoder_blocks.1/face_encoder_blocks.1.1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.1/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="onnx::Conv_590" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="12358080" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_590">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/face_encoder_blocks.1/face_encoder_blocks.1.2/conv_block/conv_block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_372" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12394944" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/face_encoder_blocks.1/face_encoder_blocks.1.2/conv_block/conv_block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.2/conv_block/conv_block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/face_encoder_blocks.1/face_encoder_blocks.1.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.2/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/face_encoder_blocks.1/face_encoder_blocks.1.2/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/face_encoder_blocks.1/face_encoder_blocks.1.2/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="onnx::Conv_593" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="12395072" size="73728" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_593">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
